Repository: RedouaneAmourBaracoda/Projet9-Baluchon
Catalog: Le-Baluchon/Ressources/Localizable.xcstrings
Source language: en
Languages: es, fr

# currency.errors.undetermined.description
source: A non-determined error with currency services occurred.
es: Se produjo un error no determinado con los servicios de divisas.
fr: Une erreur indéterminée s’est produite avec les services de change.

# currency.navigation-title
source: Currency
es: divisa
fr: Devise

# currency.no-data
source: No data available
es: datos indisponibles
fr: Données indisponibles

# currency.open-exchange-api.errors.access-restricted.user-friendly-description
source: The limit of requests to currency services has been exceeded.
es: Se ha superado el límite de solicitudes de servicios monetarios.
fr: Le nombre de requêtes vers les services monétaires a été dépassé.

# currency.open-exchange-api.errors.invalid-app-id.description
source: Client provided an invalid App ID
es: El cliente proporcionó un identificador de aplicación no válido (App ID).
fr: Le client a fourni un identifiant d'application (App ID) invalide.

# currency.open-exchange-api.errors.invalid-base.description
source: Client requested rates for an unsupported base currency
es: El cliente solicitó tipos para una moneda de base no respaldada.
fr: Le client a demandé des taux pour une devise non-disponible.

# currency.open-exchange-api.errors.invalid-request
source: An issue occured with currency services. The base currency is unsupported or access is restricted.
es: Un problema con los servicios de divisas. La divisa base no tiene soporte o el acceso está restringido.
fr: Un problème lié aux services de change est survenu. Il se peut que la devise de base ne soit pas prise en charge ou que l’accès soit restreint.

# currency.open-exchange-api.errors.invalid-request.description
source: Invalid request
es: Solicitud inválida.
fr: Requête invalide.

# currency.open-exchange-api.errors.invalid-url.description
source: Invalid url
es: URL no válida.
fr: URL invalide

# currency.open-exchange-api.errors.not-allowed.description
source: Client doesn’t have permission to access requested route/feature
es: El cliente no tiene permiso para acceder al recurso solicitado.
fr: Le client n’a pas la permission d’accéder à la ressource demandée.

# currency.open-exchange-api.errors.not-found.description
source: Client requested a non-existent resource/route
es: El cliente solicitó un recurso inexistente.
fr: La ressource demandée est inexistante.

# currency.open-exchange-api.errors.restricted-access.description
source: Access restricted for repeated over-use (status: 429), or other reason given in ‘description’ (403)
es: Acceso restringido por uso excesivo repetido (estado: 429), u otro motivo dado en 'descripción' (403).
fr: Accès restreint pour dépassement du quota autorisé (statut : 429), ou autre raison indiquée dans la description (403)

# translation.button.clear
source: Clear
es: Borrar
fr: Effacer

# translation.errors.undetermined.description
source: A non-determined error with translation services occured.
es: Se ha detectado un error con los servicios de traducción.
fr: Une erreur indéterminée avec les services de traduction est survenue.

# translation.google-translation-api.errors.bad-request.description
source: The client provided invalid parameters for the request.
es: El cliente proporcionó parámetros no válidos para la solicitud.
fr: Le client a fourni des paramètres invalides pour la requête.

# translation.google-translation-api.errors.bad-request.user-friendly-description
source: The client entered invalid text or requests unavailable resource.
es: El cliente ingresó texto no válido o solicita un recurso no disponible.
fr: Le text saisi est invalide ou la ressource demandé est inexistante.

# translation.google-translation-api.errors.forbidden.description
source: The requested operation is not allowed due to restricted access or exceeded limit of requests.
es: La operación solicitada no se permite debido a un acceso restringido o al límite de solicitudes excedido.
fr: L’opération demandée n’est pas autorisée en raison d’un accès restreint ou de la limite de demandes dépassée.

# translation.google-translation-api.errors.forbidden.user-friendly-description
source: The limit of requests to translation services has been exceeded.
es: Se ha superado el límite de solicitudes a los servicios de traducción.
fr: Le nombre de requêtes vers les services de traduction a été dépassé.

# translation.google-translation-api.errors.invalid-request.description
source: Invalid request
es: solicitud inválida
fr: Requête invalide.

source: There was an issue with translation services. Access is restricted or services are simply down.
es: Hubo un problema con los servicios de traducción. El acceso está restringido o los servicios simplemente están fuera.
fr: Les services de traduction rencontrent actuellement un problème. Il se peut que l’accès soit restreint ou que les services soient indisponibles.

# translation.google-translation-api.errors.invalid-url.description
source: Invalid URL
es: URL no válida.
fr: URL invalide.

# translation.google-translation-api.errors.not-allowed.description
source: The client doesn’t have permission to access requested route/feature
es: El cliente no tiene permiso para acceder al recurso solicitado
fr: Le client n’a pas la permission d’accéder à la ressource demandée.

# translation.google-translation-api.errors.not-found.description
source: The client requested a non-existent resource/route
es: El cliente solicitó un recurso inexistente
fr: Le client a demandé une ressource inexistante.

# translation.google-translation-api.errors.payment-required.description
source: The client has exceeded the limit of daily requests.
es: El cliente ha excedido el límite de solicitudes diarias.
fr: Le client a dépassé la limite de requêtes quotidiennes.

# translation.google-translation-api.errors.too-many-requests.description
source: The client has exceeded the limit of requests.
es: El cliente ha excedido el límite de solicitudes.
fr: Le client a dépassé la limite de requêtes.

# translation.google-translation-api.errors.unauthorized.description
source: The client provided invalid credentials or the session has expired.
es: El cliente proporcionó credenciales inválidas o la sesión ha expirado.
fr: Le client a fourni des identifiants invalides ou la session est expirée.

# translation.navigation-title
source: Translation
es: traducción
fr: Traduction

# weather.additional-info.humidity.name
source: Humidity
es: Humedad
fr: Humidité

# weather.additional-info.pressure.name
source: Pressure
es: Presión
fr: Pression

# weather.additional-info.temperature-felt.name
source: Feels
es: Sentido
fr: Ressenti

# weather.errors.no-description
source: No description
es: Descripción indisponible
fr: Description indisponible

# weather.errors.undetermined.description
source: A non-determined error with weather services occured.
es: Error no determinado con los servicios meteorológicos.
fr: Une erreur indéterminée avec les services météorologiques s’est produite.

# weather.navigation-title
source: Weather
es: Tiempo
fr: Météo

# weather.open-weather-api.errors.bad-request.description
source: Missing parameters in the request or some have incorrect format or values out of allowed range.
es: Parámetros que faltan en la solicitud o algunos tienen formato incorrecto o valores fuera del rango permitido.
fr: Paramètres manquants dans la requête ou certains ont un format incorrect ou des valeurs hors de la plage autorisée.

# weather.open-weather-api.errors.bad-request.user-friendly-description
source: The city provided does not exist in data base or has invalid format.
es: La ciudad indicada no existe en la base de datos o tiene un formato inválido.
fr: La ville indiquée n’existe pas dans la base de données ou a un format invalide.

# weather.open-weather-api.errors.internal-error.description
source: Unexpected Error due to internal issues.
es: Error inesperado debido a problemas internos.
fr: Erreur inattendue due à des problèmes internes.

# weather.open-weather-api.errors.invalid-request.description
source: Invalid request
es: solicitud inválida
fr: Requête invalide.

# weather.open-weather-api.errors.invalid-request.user-friendly-description
source: There was an issue with weather services. Access might be restricted or services are simply down.
es: Hubo un problema con los servicios meteorológicos. El acceso podría estar restringido o los servicios simplemente están fuera de servicio.
fr: Un souci est survenu avec les services météorologiques. L’accès peut être restreint ou les services sont indisponibles.

# weather.open-weather-api.errors.invalid-url.description
source: Invalid URL
es: URL no válida.
fr: URL Invalide

# weather.open-weather-api.errors.not-found.description
source: Data with requested parameters (lat, lon, date etc) does not exist in service database
es: Los datos con parámetros solicitados (lat, lon, date etc) no existen en la base de datos del servicio
fr: Les paramètres demandés (lat, lon, date etc.) n’existent pas dans la base de données du service

# weather.open-weather-api.errors.too-many-requests.description
source: Quota of requests was exceeded. Retry request later or after extending your key quota.
es: Se ha excedido la cuota de solicitudes. Vuelva a intentar la solicitud más tarde o después de ampliar su cuota clave.
fr: Le quota de demandes a été dépassé. Essayez plus tard ou après avoir changé votre quota de clés.

# weather.open-weather-api.errors.too-many-requests.user-friendly-description
source: The limit of requests to weather services has been exceeded.
es: Se ha excedido el límite de solicitudes a los servicios meteorológicos.
fr: La limite de requêtes vers les services météorologiques a été dépassée.

# weather.open-weather-api.errors.unauthorized.description
source: API token not providen in the request or if provided does not grant access to this API.
es: El token de API no se proporciona en la solicitud o si se proporciona no concede acceso a esta API.
fr: Le Token de l'API n’est pas fourni dans la requête ou alors ne permet pas d’accéder à cette API.

# weather.textfield.placeholder
source: City
es: Ciudad
fr: Ville

# weather.alert.error.title
source: Error
fr: Erreur
